# Найдите сумму цифр трехзначного числа.
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)


a = int(input())
b = int(input())
c = int(input())

print(a + b + c,      f"({a} + {b} + {c})")

